// Задача: Создать простой калькулятор на 4 действия - сложения, вычетания, произведения и деления.

using System;
public class Program
{
    public static void Main(string[] args)
    {
        Console.WriteLine("-=Простой калькулятор=-");
         = Console.ReadKey().Key;       
    }
}

