/* Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
456 -> 3
78 -> 2
89126 -> 5
*/
// Создаю переменную Ui - User Input с запросом на ввод
    Console.Write("Пожалуйста, число: ");
    string Ui = Console.ReadLine();
//
    int math = int.TryParse(Ui);
    if(math > 0)
    {

    }
    